In [1]:
import numpy as np
import pandas as pd

In [2]:
dic={'Company':['Goog','Goog','Msft','Msft','Fb','Fb'],
    'Employee':['Siam','Tanvir','Towkir','Popin','Shojon','Sazzad'],
    'Sales':[200,120,340,124,243,350]}
df=pd.DataFrame(dic)
df

  Company Employee  Sales
0    Goog     Siam    200
1    Goog   Tanvir    120
2    Msft   Towkir    340
3    Msft    Popin    124
4      Fb   Shojon    243
5      Fb   Sazzad    350

In [4]:
df.groupby('Company').mean()

         Sales
Company
Fb       296.5
Goog     160.0
Msft     232.0

In [5]:
df.groupby('Company').max()

        Employee  Sales
Company
Fb        Shojon    350
Goog      Tanvir    200
Msft      Towkir    340

In [6]:
df.groupby('Company').min()

        Employee  Sales
Company
Fb        Sazzad    243
Goog        Siam    120
Msft       Popin    124

In [7]:
df.groupby('Company').sum()

         Sales
Company
Fb         593
Goog       320
Msft       464

In [10]:
df.groupby('Company').std().loc['Goog']

Sales    56.568542
Name: Goog, dtype: float64

In [9]:
df.groupby('Company').count()

         Employee  Sales
Company
Fb              2      2
Goog            2      2
Msft            2      2

In [16]:
df.groupby('Company').describe()

        Sales
        count   mean         std    min     25%    50%     75%    max
Company
Fb        2.0  296.5   75.660426  243.0  269.75  296.5  323.25  350.0
Goog      2.0  160.0   56.568542  120.0  140.00  160.0  180.00  200.0
Msft      2.0  232.0  152.735065  124.0  178.00  232.0  286.00  340.0

In [17]:
df.groupby('Company').describe().transpose()

Company              Fb        Goog        Msft
Sales count    2.000000    2.000000    2.000000
      mean   296.500000  160.000000  232.000000
      std     75.660426   56.568542  152.735065
      min    243.000000  120.000000  124.000000
      25%    269.750000  140.000000  178.000000
      50%    296.500000  160.000000  232.000000
      75%    323.250000  180.000000  286.000000
      max    350.000000  200.000000  340.000000

In [18]:
df.groupby('Company').describe().transpose()['Fb']

Sales  count      2.000000
       mean     296.500000
       std       75.660426
       min      243.000000
       25%      269.750000
       50%      296.500000
       75%      323.250000
       max      350.000000
Name: Fb, dtype: float64